# 1장 JPA 소개


---

- **JPA는 별도의 수정 메소드가 존재하지 않는다.**

- **객체와 관계형 베이스의 차이로 인한 패러다임 불일치 문제가 존재한다.**

- **데이터베이스는 상속기능이 없다. (있지만 객체의 상속과는 다르다)**

- **슈퍼타입 서브타입 관계를 사용하면 상속과 가장 유사한 형태로 테이블 설계를 할 수 있다.**

- **JPA는 상속과 관련된 패러다임 불일치 문제를 개발자 대신 해결해준다.**

- **JPA 는 외래키 하나도 양방향 탐색이 가능하지만, 객체는 참조값이 있는 방향으로만 단방향 조회가 가능하다.**

- **객체지향 모델링을 하면 객체를 테이블에 저장하거나 조회하기가 쉽지 않다.**

- **JPA는 연관관계와 관련된 패러다임 불일치 문제를 해결해준다.**

- **데이터베이스와 객체의 비교 방법에는 차이가 있다.**

- **ORM (Object Relation Mapper)**

**엔터프라이즈 자바 빈즈(EJB)(엔티티 빈이라는 ORM기술 포함)—복잡**

**—> 하이버테이스 오픈소스 ORM 프레임워크 등장** 

**—> EJB 3.0에서 하이버네이트를 기반으로 한 새로운 자바 ORM등장 == JPA**

- **JPA를 사용하면 회원을 조회하는 SELECT SQL을 한번만 데이터베이스에 전달하고 두번째는 조회한 회원 객체를 재사용한다.**

- **JPA를 사용하면 로컬 개발 환경은 H2 데이터베이스를 사용하고 개발이나 상용 환경은 오라클이나 MySQL 를 사용할 수 있다.**
